In [1]:
import pandas as pd

## DataFrame

In [2]:
data = {'Name' :["Tom", 'Nick', 'Krish', 'jack'], 'Age': [12, 13, 14, 15], 'score' :[10, 8, 9,7]}
df = pd.DataFrame(data)
df

    Name  Age  score
0    Tom   12     10
1   Nick   13      8
2  Krish   14      9
3   jack   15      7

## Pandas Series

In [3]:
import numpy as np
data = np.asarray([1,2,3,5])
ser = pd.Series(data,index = [1,2,3,4])
print(ser)

1    1
2    2
3    3
4    5
dtype: int64

## Data Processing

In [4]:
data = pd.read_csv("data/nba.csv")
data.dropna(inplace=True)
data

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [5]:
dtype = type(data['Salary'])
salary = data['Salary'].sum()
salary
# sum=0
# for i in salary:
#     sum+=i
# print(sum/len(salary))

1681793230.0

## Basic Commands

In [6]:
import matplotlib.pyplot as plt
# data.head()
# data.tail(9)
perc=  [.20,.40,.60,.80]
# list of dtypes to include
# list of percentile 
dummy = data.describe(percentiles=perc, include=['float','int'])
dummy
data.head()
data['Team'].value_counts()
# plt.bar(, data['Team'].value_counts())

Team
New Orleans Pelicans      16
Portland Trail Blazers    15
Detroit Pistons           15
Milwaukee Bucks           14
Philadelphia 76ers        14
Oklahoma City Thunder     14
Los Angeles Clippers      14
Washington Wizards        13
Charlotte Hornets         13
Phoenix Suns              13
Sacramento Kings          13
Memphis Grizzlies         13
Brooklyn Nets             13
Boston Celtics            12
Dallas Mavericks          12
Indiana Pacers            12
Chicago Bulls             12
Los Angeles Lakers        12
Golden State Warriors     12
Houston Rockets           11
Cleveland Cavaliers       11
San Antonio Spurs         11
Atlanta Hawks             11
New York Knicks           11
Miami Heat                10
Orlando Magic             10
Toronto Raptors           10
Utah Jazz                 10
Denver Nuggets             9
Minnesota Timberwolves     8
Name: count, dtype: int64

## Drop Column

In [7]:
# data.drop(["Position"], axis=1, inplace=True)
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

## Select Row

In [8]:
data = pd.read_csv("data/nba.csv", index_col ="Name")
first = data.loc["Avery Bradley"]
first

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [9]:
data = pd.read_csv("data/nba.csv",index_col="Name")
# first = data.iloc[:10]
# first = first.loc[0]
# first

In [10]:
new_row = pd.DataFrame({'Name':"Xristos Ken", 'Team':'Miami Heats', 'Number':3, 'Position':'PF', 
            'Age':33, 'Height':'6-2', 'Weight':189, 'College':'MIT', 'Salary':99999}, index=[0])

df = pd.concat([new_row, data]).reset_index(drop=True)
df.head(9)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Xristos Ken,Miami Heats,3.0,PF,33.0,6-2,189.0,MIT,99999.0
1,NaN,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
2,NaN,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,NaN,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
4,NaN,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
5,NaN,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
6,NaN,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
7,NaN,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
8,NaN,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

## Data Cleaning

In [11]:
dat = pd.read_csv("data/nba.csv", index_col="Name")
dat.head()
dat.drop(["Avery Bradley", "Jae Crowder", "John Holland"], inplace=True)

In [12]:
dat.head()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [13]:
dat = pd.read_csv("data/nba.csv")
dat.head()
rows = data.loc[["Avery Bradley", "Jae Crowder", "John Holland"]]
# rows.head()

dat.iloc[:20]

dat.loc[:,["Name","Weight","College"]]

              Name  Weight            College
0    Avery Bradley   180.0              Texas
1      Jae Crowder   235.0          Marquette
2     John Holland   205.0  Boston University
3      R.J. Hunter   185.0      Georgia State
4    Jonas Jerebko   231.0                NaN
..             ...     ...                ...
453   Shelvin Mack   203.0             Butler
454      Raul Neto   179.0                NaN
455   Tibor Pleiss   256.0                NaN
456    Jeff Withey   231.0             Kansas
457            NaN     NaN                NaN

[458 rows x 3 columns]

## Manipulate Data with Booleans

In [14]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
df = pd.DataFrame(dict, index = [True, False, True, False])
  
df.loc[True]

        name  degree  score
True  aparna     MBA     90
True  sudhir  M.Tech     80

In [15]:
data  = pd.read_csv("data/nba.csv")
data.head()
college_filter = data['College'] == 'MIT'
age_filter = data['Age'] >=25
age_filter.head()
# college_filter.to_csv("boolean.csv")

# Masking
# mask = data.index>7 and data.index<50
# data[mask]
mask = data.index>7

print(data[mask])

                Name            Team  Number Position   Age Height  Weight  \
8       Terry Rozier  Boston Celtics    12.0       PG  22.0    6-2   190.0
9       Marcus Smart  Boston Celtics    36.0       PG  22.0    6-4   220.0
10   Jared Sullinger  Boston Celtics     7.0        C  24.0    6-9   260.0
11     Isaiah Thomas  Boston Celtics     4.0       PG  27.0    5-9   185.0
12       Evan Turner  Boston Celtics    11.0       SG  27.0    6-7   220.0
..               ...             ...     ...      ...   ...    ...     ...
453     Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454        Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455     Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456      Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457              NaN             NaN     NaN      NaN   NaN    NaN     NaN

            College     Salary
8        Louisville  1824360.0
9    Oklahoma State  3431040.0
10       Ohio State  2569260.0
11       Washington  6912869.0
12       Ohio State  3425510.0
..              ...        ...
453          Butler  2433333.0
454             NaN   900000.0
455             NaN  2900000.0
456          Kansas   947276.0
457             NaN        NaN

[450 rows x 9 columns]

## Pandas Operations

In [16]:
import pandas as pd
data = pd.read_csv("data/stocks.csv")
data.head()

  symbol     open     high     low    close    volume
0    AAL    49.00    49.10   48.47    48.63  11901883
1   AAPL   145.13   147.16  145.11   146.28  33917635
2   ADBE   143.75   145.59  143.06   145.41   3383524
3   AMZN  1002.54  1004.62  998.02  1003.74   2832807
4  GOOGL   975.50   986.62  974.46   986.09   1524905

In [17]:
def classify_stock(num):
    if num <200:
        return "Low"
    elif num>=200 and num<=400:
        return "Normal"
    else:
        return "High"

In [18]:
def analyze_stock_prices(df):
    if "close" in df.columns:
        print(df)
        df["Price_Category"] =  df["close"].apply(classify_stock)
        return df
    else:
        return "Dataframe error"

In [19]:
result = analyze_stock_prices(data)
result

  symbol     open     high     low    close    volume
0    AAL    49.00    49.10   48.47    48.63  11901883
1   AAPL   145.13   147.16  145.11   146.28  33917635
2   ADBE   143.75   145.59  143.06   145.41   3383524
3   AMZN  1002.54  1004.62  998.02  1003.74   2832807
4  GOOGL   975.50   986.62  974.46   986.09   1524905
5    MAT    20.22    20.75   20.11    20.68  10603967
6   MSFT    70.09    71.25   69.92    71.21  26803888
7   NTES   320.00   333.78  319.00   333.56   1356386

  symbol     open     high     low    close    volume Price_Category
0    AAL    49.00    49.10   48.47    48.63  11901883            Low
1   AAPL   145.13   147.16  145.11   146.28  33917635            Low
2   ADBE   143.75   145.59  143.06   145.41   3383524            Low
3   AMZN  1002.54  1004.62  998.02  1003.74   2832807           High
4  GOOGL   975.50   986.62  974.46   986.09   1524905           High
5    MAT    20.22    20.75   20.11    20.68  10603967            Low
6   MSFT    70.09    71.25   69.92    71.21  26803888            Low
7   NTES   320.00   333.78  319.00   333.56   1356386         Normal

In [20]:
data.aggregate({'open':['sum','min'],
               'high':['sum','min'] })
data[8] = {'symbol':'AAL' , 'open':49, 'high':49.1,'low':48.47, 'close':48.63}
# data.mean(axis=0, skipna=True)
# data.mad()
# data.value_counts()